import {
  Scale,
  BookOpen,
  CircleAlert,
  CircleQuestionMark,
  FileText,
} from 'lucide-react-native';

export const policyAndLawData = [
  {
    id: 1,
    title: `মানব পাচার বিরোধী আইন(বাংলাদেশ)`,
    description:
      'মানব পাচার প্রতিরোধ ও দমন আইন, ২০১২ অনুযায়ী মানব পাচার একটি গুরুতর অপরাধ। এই আইনে পাচারের সংজ্ঞা, অপরাধের ধরন, শাস্তির বিধান এবং ভুক্তভোগীদের সুরক্ষার বিষয়গুলো স্পষ্টভাবে উল্লেখ করা হয়েছে।',
    icon: Scale,
    iconBgColor: 'rgba(20, 71, 230, 1)',
    iconColors: '#FFFFFF',
  },
  {
    id: 2,
    title: 'ভুক্তভোগীর অধিকার',
    description:
      'মানব পাচারের শিকার ব্যক্তিরা আইনি সুরক্ষা, চিকিৎসা সহায়তা, নিরাপদ আশ্রয় এবং পুনর্বাসনের অধিকার রাখেন। আইন অনুযায়ী তাদের পরিচয় গোপন রাখা এবং মানসিক সহায়তা প্রদান বাধ্যতামূলক।',
    icon: BookOpen,
    iconBgColor: 'rgba(0, 120, 111, 1)',
    iconColors: '#FFFFFF',
  },
  {
    id: 3,
    title: 'শাস্তির বিধান',
    description:
      'মানব পাচারের সঙ্গে জড়িত ব্যক্তিদের জন্য কঠোর শাস্তির বিধান রয়েছে, যার মধ্যে দীর্ঘমেয়াদি কারাদণ্ড ও অর্থদণ্ড অন্তর্ভুক্ত। অপরাধের মাত্রা অনুযায়ী শাস্তি নির্ধারণ করা হয়।',
    icon: CircleAlert,
    iconBgColor: 'rgba(231, 0, 11, 1)',
    iconColors: '#FFFFFF',
  },
  {
    id: 4,
    title: 'আইনি সহায়তা পাওয়ার উপায়',
    description:
      'ভুক্তভোগীরা সরকারি আইন সহায়তা কেন্দ্র, জেলা লিগ্যাল এইড অফিস অথবা নির্দিষ্ট হেল্পলাইনের মাধ্যমে বিনামূল্যে আইনি সহায়তা পেতে পারেন। প্রয়োজনে মামলা পরিচালনায় সহায়তাও দেওয়া হয়।',
    icon: CircleQuestionMark,
    iconBgColor: 'rgba(130, 0, 219, 1)',
    iconColors: '#FFFFFF',
  },
  {
    id: 5,
    title: 'গুরুত্বপূর্ণ সরকারি নির্দেশনা',
    description:
      'মানব পাচার প্রতিরোধে সরকার নিয়মিত বিভিন্ন নির্দেশনা ও সচেতনতামূলক পদক্ষেপ গ্রহণ করে। এসব নির্দেশনা অনুসরণ করলে ঝুঁকি কমে এবং আইনি সুরক্ষা নিশ্চিত হয়।',
    icon: FileText,
    iconBgColor: 'rgba(245, 73, 0, 1)',
    iconColors: '#FFFFFF',
  },
];
