import { BookOpen, AlertTriangle, Users, Briefcase } from 'lucide-react-native';

export const preventData = [
  {
    id: '1',
    title: 'শিক্ষামূলক গুরুত্বপূর্ণ লিংক',
    gradientColors: ['#0D9488', '#0F766E'],
    icon: BookOpen,
    items: [
      {
        id: '1-1',
        text: 'শিক্ষা পোর্টাল ব্যবহার করতে চাইলে এখানে বিস্তারিত জানুন',
      },
      {
        id: '1-2',
        text: 'শিক্ষাপ্রতিষ্ঠান সংক্রান্ত নিবন্ধন পত্র সম্পূর্ণ প্রক্রিয়া জানুন',
      },
      {
        id: '1-3',
        text: 'শিক্ষার্থী অভিভাবক ও শিক্ষক এর জন্য বিশেষ নির্দেশনা',
      },
      {
        id: '1-4',
        text: 'শিক্ষার্থী প্রযুক্তি প্রবাহ সম্পূর্ণ প্রক্রিয়ায় জানুন',
      },
    ],
  },
  {
    id: '2',
    title: 'জরুরী অবস্থায় দ্রুত এডভাইস নিন',
    gradientColors: ['#DC2626', '#B91C1C'],
    icon: AlertTriangle,
    items: [
      {
        id: '2-1',
        text: 'চিকিৎসায় আর্থিক সহায়তা পেতে চাইলে প্রদান প্রক্রিয়া ও রিপোর্ট সংক্রান্ত এ',
      },
      { id: '2-2', text: 'শিশুর কোন সমস্যা হলে এখানে যোগাযোগ করে অবহিত করুন' },
      {
        id: '2-3',
        text: 'জরুরিকালীন পরিচালনা কেন্দ্র প্রয়োজন হলে আমাদের সাথে যোগাযোগ করুন',
      },
      {
        id: '2-4',
        text: 'শিশুদের বা কিশোরদের জরুরী প্রশিক্ষণ ও ডায়েট পরিচালনা জানুন',
      },
    ],
  },
  {
    id: '3',
    title: 'সামাজিক সহায়তা অ্যাক্টিভিটি',
    gradientColors: ['#EA580C', '#C2410C'],
    icon: Users,
    items: [
      {
        id: '3-1',
        text: 'প্রতিবন্ধী ব্যক্তিদের জন্য বিশেষ মাসিক ভাতা পেতে শিখুন',
      },
      {
        id: '3-2',
        text: 'বয়স্ক অভিভাবক দের জন্য ভর্তুকি ভাতার আবেদন করুন এখানে',
      },
      {
        id: '3-3',
        text: 'শিশুদের অভিভাবক নেই এমন জন্য মুহম্মদপুর আইনী সাহায্য নিন',
      },
      {
        id: '3-4',
        text: 'বিধবা নারী ও বিশেষ মূল্যনীতি পাওয়ার জন্য তথ্য নিতে যাব এখানে',
      },
    ],
  },
  {
    id: '4',
    title: 'শিশু ও এতিম শিক্ষার্থী কল্যাণ',
    gradientColors: ['#9333EA', '#7E22CE'],
    icon: Briefcase,
    items: [
      {
        id: '4-1',
        text: 'শিশুদের সরকারীভাবে সংরক্ষণ ব্যবস্থা নিতে প্রয়োজন কোথায় যাবেন',
      },
      { id: '4-2', text: 'পথশিশুদের পুনর্বাসন নীতিমালা সম্পূর্ণ জানতে চান' },
      { id: '4-3', text: 'এতিমদের নানা জন্য বিশেষ সুযোগ সুবিধা দেয়া হয়' },
    ],
  },
];
