import {
  BookOpen,
  AlertTriangle,
  Users,
  Briefcase,
  Plane,
} from 'lucide-react-native';

export const preventData = [
  {
    id: '1',
    title: 'নিরাপদ ভ্রমণ নির্দেশনা',
    gradientColors: ['#0D9488', '#0F766E'],
    icon: Plane,
    items: [
      {
        id: '1-1',
        text: 'বিদেশ যাওয়ার আগে সঠিক ভিসা এবং কাগজপত্র যাচাই করুন',
      },
      {
        id: '1-2',
        text: 'নিয়োগকর্তা এবং এজেন্সির লাইসেন্স পরীক্ষা করুন',
      },
      {
        id: '1-3',
        text: 'চুক্তিপত্র ভালোভাবে পড়ে বুঝে স্বাক্ষর করুন',
      },
      {
        id: '1-4',
        text: 'গন্তব্য দেশের নিয়ম-কানুন সম্পর্কে জানুন',
      },
    ],
  },
  {
    id: '2',
    title: 'ভুয়া চাকরির ফাঁদ এড়িয়ে চলুন',
    gradientColors: ['#DC2626', '#B91C1C'],
    icon: AlertTriangle,
    items: [
      {
        id: '2-1',
        text: 'অস্বাভাবিক উচ্চ বেতনের প্রলোভন থেকে সাবধান',
      },
      { id: '2-2', text: 'অগ্রিম বড় অঙ্কের টাকা চাইলে সন্দেহ করুন ' },
      {
        id: '2-3',
        text: 'কোম্পানির ঠিকানা এবং যোগাযোগ যাচাই করুন',
      },
      {
        id: '2-4',
        text: 'শিশুদের বা কিশোরদের জরুরী প্রশিক্ষণ ও ডায়েট পরিচালনা জানুন',
      },
    ],
  },
  {
    id: '3',
    title: 'সামাজিক সহায়তা অ্যাক্টিভিটি',
    gradientColors: ['#EA580C', '#C2410C'],
    icon: Users,
    items: [
      {
        id: '3-1',
        text: 'প্রতিবন্ধী ব্যক্তিদের জন্য বিশেষ মাসিক ভাতা পেতে শিখুন',
      },
      {
        id: '3-2',
        text: 'বয়স্ক অভিভাবক দের জন্য ভর্তুকি ভাতার আবেদন করুন এখানে',
      },
      {
        id: '3-3',
        text: 'শিশুদের অভিভাবক নেই এমন জন্য মুহম্মদপুর আইনী সাহায্য নিন',
      },
      {
        id: '3-4',
        text: 'বিধবা নারী ও বিশেষ মূল্যনীতি পাওয়ার জন্য তথ্য নিতে যাব এখানে',
      },
    ],
  },
  {
    id: '4',
    title: 'শিশু ও এতিম শিক্ষার্থী কল্যাণ',
    gradientColors: ['#9333EA', '#7E22CE'],
    icon: Briefcase,
    items: [
      {
        id: '4-1',
        text: 'শিশুদের সরকারীভাবে সংরক্ষণ ব্যবস্থা নিতে প্রয়োজন কোথায় যাবেন',
      },
      { id: '4-2', text: 'পথশিশুদের পুনর্বাসন নীতিমালা সম্পূর্ণ জানতে চান' },
      { id: '4-3', text: 'এতিমদের নানা জন্য বিশেষ সুযোগ সুবিধা দেয়া হয়' },
    ],
  },
];
